---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.DeletingBadFamElemError
source: html/ce41f52a-90f4-ddbf-d0da-207c2e2cd524.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.DeletingBadFamElemError Property

Family contains invalid elements. They will be deleted.

## Syntax (C#)
```csharp
public static FailureDefinitionId DeletingBadFamElemError { get; }
```